garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1705.PIC
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1PHR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x691">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1PHR" edc:desc="" edc:mask="0x3f" edc:name="G1PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHR0" edc:desc="" edc:mask="0x1" edc:name="G1PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR1" edc:desc="" edc:mask="0x1" edc:name="G1PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR2" edc:desc="" edc:mask="0x1" edc:name="G1PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR3" edc:desc="" edc:mask="0x1" edc:name="G1PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR4" edc:desc="" edc:mask="0x1" edc:name="G1PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR5" edc:desc="" edc:mask="0x1" edc:name="G1PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1PHF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x692">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1PHF" edc:desc="" edc:mask="0x3f" edc:name="G1PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHF0" edc:desc="" edc:mask="0x1" edc:name="G1PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF1" edc:desc="" edc:mask="0x1" edc:name="G1PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF2" edc:desc="" edc:mask="0x1" edc:name="G1PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF3" edc:desc="" edc:mask="0x1" edc:name="G1PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF4" edc:desc="" edc:mask="0x1" edc:name="G1PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF5" edc:desc="" edc:mask="0x1" edc:name="G1PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1BLKR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x693">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1BLKR" edc:desc="" edc:mask="0x3f" edc:name="G1BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKR0" edc:desc="" edc:mask="0x1" edc:name="G1BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR1" edc:desc="" edc:mask="0x1" edc:name="G1BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR2" edc:desc="" edc:mask="0x1" edc:name="G1BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR3" edc:desc="" edc:mask="0x1" edc:name="G1BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR4" edc:desc="" edc:mask="0x1" edc:name="G1BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR5" edc:desc="" edc:mask="0x1" edc:name="G1BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1BLKF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x694">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1BLKF" edc:desc="" edc:mask="0x3f" edc:name="G1BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKF0" edc:desc="" edc:mask="0x1" edc:name="G1BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF1" edc:desc="" edc:mask="0x1" edc:name="G1BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF2" edc:desc="" edc:mask="0x1" edc:name="G1BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF3" edc:desc="" edc:mask="0x1" edc:name="G1BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF4" edc:desc="" edc:mask="0x1" edc:name="G1BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF5" edc:desc="" edc:mask="0x1" edc:name="G1BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1DBR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1DBR" edc:desc="" edc:mask="0x3f" edc:name="G1DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBR0" edc:desc="" edc:mask="0x1" edc:name="G1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR1" edc:desc="" edc:mask="0x1" edc:name="G1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR2" edc:desc="" edc:mask="0x1" edc:name="G1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR3" edc:desc="" edc:mask="0x1" edc:name="G1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR4" edc:desc="" edc:mask="0x1" edc:name="G1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR5" edc:desc="" edc:mask="0x1" edc:name="G1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1DBF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1DBF" edc:desc="" edc:mask="0x3f" edc:name="G1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBF0" edc:desc="" edc:mask="0x1" edc:name="G1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF1" edc:desc="" edc:mask="0x1" edc:name="G1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF2" edc:desc="" edc:mask="0x1" edc:name="G1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF3" edc:desc="" edc:mask="0x1" edc:name="G1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF4" edc:desc="" edc:mask="0x1" edc:name="G1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF5" edc:desc="" edc:mask="0x1" edc:name="G1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
